/* eslint-disable max-len */
const russian = {
  default: [
    [{ ё: 192 }, { 1: 49 }, { 2: 50 }, { 3: 51 }, { 4: 52 }, { 5: 53 }, { 6: 54 }, { 7: 55 }, { 8: 56 }, { 9: 57 }, { 0: 48 }, { '-': 189 }, { '=': 187 }, { Backspace: 'Backspace' }],
    [{ Tab: 9 }, { й: 81 }, { ц: 87 }, { у: 69 }, { к: 82 }, { е: 84 }, { н: 89 }, { г: 85 }, { ш: 73 }, { щ: 79 }, { з: 80 }, { х: 219 }, { ъ: 221 }, { '\\': 220 }],
    [{ Capslock: 20 }, { ф: 65 }, { ы: 83 }, { в: 68 }, { а: 70 }, { п: 71 }, { р: 72 }, { о: 74 }, { л: 75 }, { д: 76 }, { ж: 186 }, { э: 222 }, { Enter: 13 }],
    [{ Shift: 'ShiftLeft' }, { я: 90 }, { ч: 88 }, { с: 67 }, { м: 86 }, { и: 66 }, { т: 78 }, { ь: 77 }, { б: 188 }, { ю: 190 }, { '.': 191 }, { Shift: 'ShiftRight' }],
    [{ Ctrl: 'ControlLeft' }, { Fn: 255 }, { Win: 'MetaLeft' }, { Alt: 'AltLeft' }, { '': 'Space' }, { Alt: 'AltRight' }, { Ctrl: 'ControlRight' }, { '&larr;': 37 }, { '&uarr;': 38 }, { '&darr;': 40 }, { '&rarr;': 39 }],
  ],
  shift: [
    [{ Ё: 192 }, { '!': 49 }, { '"': 50 }, { '№': 51 }, { ';': 52 }, { '%': 53 }, { ':': 54 }, { '?': 55 }, { '*': 56 }, { '(': 57 }, { ')': 48 }, { _: 189 }, { '+': 187 }, { Backspace: 'Backspace' }],
    [{ Tab: 9 }, { Й: 81 }, { Ц: 87 }, { У: 69 }, { К: 82 }, { Е: 84 }, { Н: 89 }, { Г: 85 }, { Ш: 73 }, { Щ: 79 }, { З: 80 }, { Х: 219 }, { Ъ: 221 }, { '/': 220 }],
    [{ Capslock: 20 }, { Ф: 65 }, { Ы: 83 }, { В: 68 }, { А: 70 }, { П: 71 }, { Р: 72 }, { О: 74 }, { Л: 75 }, { Д: 76 }, { Ж: 186 }, { Э: 222 }, { Enter: 13 }],
    [{ Shift: 'ShiftLeft' }, { Я: 90 }, { Ч: 88 }, { С: 67 }, { М: 86 }, { И: 66 }, { Т: 78 }, { Ь: 77 }, { Б: 188 }, { Ю: 190 }, { ',': 191 }, { Shift: 'ShiftRight' }],
    [{ Ctrl: 'ControlLeft' }, { Fn: 255 }, { Win: 'MetaLeft' }, { Alt: 'AltLeft' }, { '': 'Space' }, { Alt: 'AltRight' }, { Ctrl: 'ControlRight' }, { '&larr;': 37 }, { '&uarr;': 38 }, { '&darr;': 40 }, { '&rarr;': 39 }],
  ],
}

export default russian
